app/controllers/api/v1/tags_controller.rb

SELECT "tags".* FROM "tags" ORDER BY "tags"."name" ASC
---
      def index
        render json: TagBlueprint.render(Tag.order(:name))

INSERT INTO "tags" ("name", "system", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "новый тег"], ["system", false], ["created_at", "2026-05-12 11:28:07.093918"], ["updated_at", "2026-05-12 11:28:07.093918"]]
---
      def create
        new_tag = Tag.new(tag_params)
        if new_tag.save

DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 20]]
---
      def destroy
        if tag.system?
          render json: { error: "System tags cannot be deleted" }, status: :forbidden
        else
          tag.destroy!