app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT "task_tags".* FROM "task_tags" WHERE "task_tags"."task_id" = $1  [["task_id", 48]]
---
      def index
        tasks = Task.includes(:tags).order(created_at: :desc)
        tasks = tasks.where(status: params[:status]) if params[:status].present?

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 54]]
---
      def destroy
        task.destroy!