app/controllers/api/v1/task_tags_controller.rb

      def create
        tag = Tag.find(tag_id_param)
        task.tags << tag unless task.tags.include?(tag)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
INSERT INTO "task_tags" ("task_id", "tag_id") VALUES ($1, $2) RETURNING "id"  [["task_id", 55], ["tag_id", 22]]
SELECT "tags".* FROM "tags" INNER JOIN "task_tags" ON "tags"."id" = "task_tags"."tag_id" WHERE "task_tags"."task_id" = $1  [["task_id", 55]]
SELECT 1 AS one FROM "tags" INNER JOIN "task_tags" ON "tags"."id" = "task_tags"."tag_id" WHERE "task_tags"."task_id" = $1 AND "tags"."id" = $2 LIMIT $3  [["task_id", 55], ["id", 22], ["LIMIT", 1]]

      def destroy
        tag = task.tags.find(params[:id])
        task.tags.delete(tag)
---
SELECT "tags".* FROM "tags" INNER JOIN "task_tags" ON "tags"."id" = "task_tags"."tag_id" WHERE "task_tags"."task_id" = $1 AND "tags"."id" = $2 LIMIT $3  [["task_id", 57], ["id", 23], ["LIMIT", 1]]
DELETE FROM "task_tags" WHERE "task_tags"."task_id" = $1 AND "task_tags"."tag_id" = $2  [["task_id", 57], ["tag_id", 23]]